### Ok, the first requirement is 

1. La universidad opera de forma presencial y con planes de estudios semestrales. Se debe registrar la información de cada plan de estudios como: nombre, clave, duración en semestres, número de créditos totales, estatus (vigente o no).

This seems to just be a table. The format is

CREATE TABLE study_plan(
    ID SERIAL PRIMARY KEY,
    name VARCHAR(100),
    code VARCHAR(50),
    duration INTEGER,
    credits INTEGER,
    status BOOL,
);

I don't think code and ID are the same, as the code probably has implicit information about what subject is related to, the undergraduate that is imparted in, etc. As it probably has both letters and numbers I think it is better to just leave it as VARCHAR. 

I don't know if you declare a boolean variable in postgreSQL with BOOL, but I will know once I run the code. 

As this table doesn't has any foreign key is a strong entity; one of the first ones I will create in the database. 

### The second requirement is 

2. Se debe almacenar la información de todas las materias comprendidas en cada plan de estudios: clave, nombre, número de horas, número de horas teóricas, numéro de horas de práctica, número de créditos, área de especialización.

CREATE TABLE subjects(
    ID SERIAL PRIMARY KEY,
    name VARCHAR(100),
    hours INTEGER,
    theorical_hours INTEGER,
    practical_hours INTEGER,
    credits INTEGER,
    area 
);

In area I will most probably need a foreign key. It seems that the relationship is one to one. I think that I should put the rule here that no attribute of this table can be null, but also that the arithmetic sum of the 'theorical_hours' and 'practical_hours' must be equal or less than 'hours'. 

### The third requirement is 

3. Se debe almacenar la información personal del alumno como: nombre completo, nacionalidad, curp, fecha de nacimiento, correo electrónico personal, teléfono, dirección, estado civil, tipo de sangre, numero de seguridad social. No es posible que dos estudiantes compartan correo electrónico.

Another table

CREATE TABLE students(
    ID SERIAL PRIMARY KEY,
    name VARCHAR(100),
    nacionality VARCHAR(10),
    curp VARCHAR(30), 
    birth_date DATE,
    email TEXT UNIQUE,
    telephone VARCHAR(15),
    city VARCHAR(100), 
    state VARCHAR(100), 
    street VARCHAR(100),
    external_number INTEGER,
    zip_code INTEGER,
);

Creating tables for the last names seems excessive, but useful at the same time... not really, I don't think having separate tables for the last names will help more than just doing a normal SQL search. My doubt is how can I ensure that the students will fill out the information in the 'Name PaternalName MaternalName' standard? 

In nacionality I have doubt too. I should probably have a list of codes that map all the nacionalities in the world, and nationality as an attribute to just be a number. 

The same goes for the CURP... I could use regex to ensure at least the curp that the student wrote makes sense, as I have already done it for the subject of formal languages. 

I will stop worrying for that now, as it seems that I can get into the same trouble with all the students' attributes. 

I know I need to pay special attention to the adress in order to comply with 3rd Normal Form. It seems that the way to do so is by breaking adress into composite values such as street, external number and zip code. 

It seems that for email I need to use TEXT in addition to a CHECK constraint. Indeed I can use regex for the email or other camps. 

As I have already wrote quite a bit of text I will start with the code. First importing psycopg2 for postgreSQL.

In [59]:
import psycopg
from dotenv import load_dotenv
import os

load_dotenv()

def conn_to_postgres(query, params = None, fetch = False):
    conn = None

    try:
        conn = psycopg.connect(
            host="localhost",
            dbname="unam_database",
            user="schronding",
            password=os.getenv('PASSWORD'),
            port="5432", 
        ) 

        conn.autocommit = True
        cur = conn.cursor()

        cur.execute(query, params)

        if fetch:
            result = cur.fetchone()[0]
            cur.close()
            conn.close()
            return result
            
        results = cur.fetchall()

        for row in results:
            print(row)

        cur.close()
        return conn
    
    except(Exception, psycopg.DatabaseError) as e:
        print(f"Error: {e}")
        if conn:
            cur.close()
        return None

Before executing the function (which I think it is wrong as I probably confuse what the difference between the connection and cursor is), I need to create the database... but I don't remember the syntax 

**postgres=# CREATE DABATASE unam_database;**

*ERROR:  syntax error at or near "DABATASE"*

*LINE 1: CREATE DABATASE unam_database;*

I wrote DATABASE wrong... Now it works.

It seems that while the syntax is correct I am not able to set schronding as the owner of 'unam_database'. I think it probably has to do with me not creating this role for this specific database. 

postgres=# CREATE DABATASE unam_database;

ERROR:  syntax error at or near "DABATASE"

LINE 1: CREATE DABATASE unam_database;

To check the roles I can use \du and \du+. 

I am having trouble now even entering to the postgres terminal 

**sudo psql -U postgres**

psql: error: connection to server on socket "/var/run/postgresql/.s.PGSQL.5432" failed: FATAL:  Peer authentication failed for user "postgres"

It seems that I can reconfigure the 'pg_hba.conf' file to trust my local computer... but I don't know where is located. It doesn't work with 'whereis' on the terminal. 

I will just use sudo -u postgres psql. 

It seems I am still denied permision but the terminal appeared again

**sudo -u postgres psql**

could not change directory to "/home/schronding/repos/UNAM_database": 

Permission denied

psql (15.14 (Debian 15.14-0+deb12u1))

It wasn't that my role didn't exist, as it already does 

**postgres=# CREATE ROLE schronding;**

ERROR:  role "schronding" already exists

With the command 

**ALTER ROLE schronding WITH LOGIN PASSWORD MarioYChuyBFF**

the postgres terminal changed from 'postgres=#' to 'postgres-#'. I don't know what it means the change from = to -. It seems that the difference is that when it goes to - it means that you haven't finished executing the previous command. I think this could be useful to create tables with multiple attributes. 

I think I should probably use the library of running terminal scripts in python, as I think that would cut the need to copy all my commands and their output. The library's name is 'subprocess'. It might not work, as there are two levels of 'depth' with the postgres terminal.

In [2]:
import subprocess

study_plan_table = """
DROP TABLE IF EXISTS study_plans CASCADE; 

CREATE TABLE study_plans(
    id SERIAL PRIMARY KEY,
    name VARCHAR(100) UNIQUE,
    code VARCHAR(50),
    duration INTEGER,
    credits INTEGER,
    status BOOLEAN NOT NULL
);"""

conn_to_postgres(study_plan_table)

I had some errors

Error: invalid connection option "name"

Multiple connection attempts failed. All failures were:
- host: 'localhost', port: '5432', hostaddr: '::1': invalid connection option "name"

- host: 'localhost', port: '5432', hostaddr: '127.0.0.1': invalid connection option "name"

The thing with psycopg is that it seems that the order of the attributes matter, even though I am explicitly telling the parameters by name. While psycopg seems to be a better version than psycopg2 I might be getting all of these problems just by the difference in versions, as the conn that I remembered was with psycopg2. 

Also prior to that I forgot that in the except clause we need 'Exception', not 'Error'. Also that the port must be a string, not a number. 

It is interesting, because when I put name it throwed an error, when I changed the attribute to database it did too. It seems that the attribute itself is the problem. 

I don't know what the problem is... 

It was just that the correct name attribute was 'dbname'...

At least now I get a different error, which I understand

Error: connection failed: connection to server at "127.0.0.1", port 5432 failed: fe_sendauth: no password supplied
Multiple connection attempts failed. All failures were:
- host: 'localhost', port: '5432', hostaddr: '::1': connection failed: connection to server at "::1", port 5432 failed: fe_sendauth: no password supplied
- host: 'localhost', port: '5432', hostaddr: '127.0.0.1': connection failed: connection to server at "127.0.0.1", port 5432 failed: fe_sendauth: no password supplied

What I don't understand is why the password isn't correctly retrieved. Could it be that by being in a Jupyter notebook, the getenv method doesn't recognize that there is a hidden file .env in the local environment? 

Indeed when I try to get the password it doesn't retrieve it

In [3]:
#print(os.getenv("PASSWORD"))

I now see what the problem was... I didn't include the 'load_dotenv()' function. 

Now it finally works 

<psycopg.Connection [IDLE] (host=localhost user=schronding database=unam_database) at 0x7f13f52178c0>

In [4]:
print(conn_to_postgres("SELECT ALL"))

<psycopg.Connection [IDLE] (host=localhost user=schronding database=unam_database) at 0x7f75eab647d0>

What I wanted to see was if there was a good formated answer for when I made a SQL request. I will research it later, I think I can continue with the second table. Thinking it more slowly I do think that while on the ENES there might be different versions of the same subject, for example 'Probabilidad y Estadistica' for technology and other for aeroespacial engineering, I think it makes sense that one subject can belong to many study plans, creating a connection one to many. 

Part of me thinks that many to many is correct, but is redundant. Can one study plan be involved in a lot of subjects? Yes, but is it relevant? Do I need to write the intermediate table? For now I will do it. 

As the intermediate or pivot table has foreign keys is weak, but subjects is weak too. Is there any difference by which I create first?

In [5]:
plan_subjects_pivot_table = """
DROP TABLE IF EXISTS plan_subjects CASCADE;

CREATE TABLE plan_subjects(
    plan_id INTEGER,
    subject_id INTEGER,
    FOREIGN KEY (plan_id) REFERENCES study_plans(id),
    FOREIGN KEY (subject_id) REFERENCES subjects(id)
);
"""

conn_to_postgres(plan_subjects_pivot_table)

As I got the error

Error: syntax error at or near "FOREIGN"
LINE 5:     plan_id FOREIGN KEY id REFERENCES plan(id),
                    ^

I will try to first create the subjects table without the foreign key, and then execute the pivot table.

In [43]:
subjects_table = """
DROP TABLE IF EXISTS subjects CASCADE;

CREATE TABLE subjects(
    ID SERIAL PRIMARY KEY,
    name VARCHAR(100) UNIQUE,
    theorical_hours INTEGER,
    practical_hours INTEGER,
    hours INTEGER,
    credits INTEGER,
    area VARCHAR(100),
    career INTEGER,
    FOREIGN KEY (career) REFERENCES study_plans(id),
    CONSTRAINT hours CHECK (theorical_hours + practical_hours <= hours)
);"""

conn_to_postgres(subjects_table)

It seems I got the error 

Error: syntax error at or near ")"
LINE 11: );
         ^

Because I left the last attribute with a comma at the end. When I removed it I got a sucessful message again. 

<psycopg.Connection [IDLE] (host=localhost user=schronding database=unam_database) at 0x7f13f52db9b0>

The error remains in the pivot table though. I will continue with the students table while I think how to solve that error

In [24]:
students_table ="""
DROP TABLE IF EXISTS students CASCADE;

CREATE TABLE students(
    ID SERIAL PRIMARY KEY,
    first_names VARCHAR(100),
    paternal_surname VARCHAR(100),
    maternal_surname VARCHAR(100), 
    nationality VARCHAR(2),
    curp VARCHAR(30), 
    birth_date DATE,
    email TEXT UNIQUE,
    telephone VARCHAR(15),
    city VARCHAR(100), 
    state VARCHAR(100), 
    street VARCHAR(100),
    external_number INTEGER,
    zip_code INTEGER,
    marital_status MARITALSTATUS,
    blood_type BLOODTYPE,
    NSS INTEGER,
    tutor_id INTEGER,
    status STATUS,
    isregular BOOLEAN, 
    FOREIGN KEY (tutor_id) REFERENCES professors(id),
    FOREIGN KEY (nationality) REFERENCES nationalities(code)
);"""

conn_to_postgres(students_table)

It seems it worked! 

<psycopg.Connection [IDLE] (host=localhost user=schronding database=unam_database) at 0x7f13f41456a0>

As I don't like that nacionality is VARCHAR I will use the lookup table of formal languages so I can change the type to a number. 

### Nacionalities

```Java
        paises.add("MX : MÉXICO");
        paises.add("DE : ALEMANIA");
        paises.add("AD : ANDORRA");
        paises.add("AR : ARGENTINA");
        paises.add("AU : AUSTRALIA");
        paises.add("AT : AUSTRIA");
        paises.add("BE : BÉLGICA");
        paises.add("BO : BOLIVIA");
        paises.add("BR : BRASIL");
        paises.add("CA : CANADÁ");
        paises.add("CL : CHILE");
        paises.add("CN : CHINA");
        paises.add("CO : COLOMBIA");
        paises.add("KR : COREA DEL SUR");
        paises.add("CR : COSTA RICA");
        paises.add("CU : CUBA");
        paises.add("DK : DINAMARCA");
        paises.add("EC : ECUADOR");
        paises.add("EG : EGIPTO");
        paises.add("SV : SALVADOR, EL");
        paises.add("ES : ESPAÑA");
        paises.add("US : ESTADOS UNIDOS DE AMÉRICA");
        paises.add("PH : FILIPINAS");
        paises.add("FI : FINLANDIA");
        paises.add("FR : FRANCIA");
        paises.add("GR : GRECIA");
        paises.add("GT : GUATEMALA");
        paises.add("HN : HONDURAS");
        paises.add("IN : INDIA");
        paises.add("ID : INDONESIA");
        paises.add("IE : IRLANDA");
        paises.add("IL : ISRAEL");
        paises.add("IT : ITALIA");
        paises.add("JM : JAMAICA");
        paises.add("JP : JAPON");
        paises.add("MA : MARRUECOS");
        paises.add("NI : NICARAGUA");
        paises.add("NO : NORUEGA");
        paises.add("NZ : NUEVA ZELANDA");
        paises.add("PA : PANAMA");
        paises.add("PY : PARAGUAY");
        paises.add("PE : PERÚ");
        paises.add("PL : POLONIA");
        paises.add("PT : PORTUGAL");
        paises.add("PR : PUERTO RICO");
        paises.add("GB : REINO UNIDO");
        paises.add("CZ : CHECA, REPÚBLICA");
        paises.add("DO : DOMICANA, REPÚBLICA");
        paises.add("RU : RUSIA");
        paises.add("ZA : SUDÁFRICA");
        paises.add("SE : SUECIA");
        paises.add("CH : SUIZA");
        paises.add("TH : TAILANDIA");
        paises.add("TR : TURQUÍA");
        paises.add("UA : UCRANIA");
        paises.add("UY : URUGUAY");
        paises.add("VE : VENEZUELA");
```

### Regex 

While it is in Java I will store here the regex in case they come in handy later down the line 

```Java
static {
        REGEX_MAP.put("Nombre(s)", "^[A-ZÁÉÍÓÚÑ ]{1,20}$");
        REGEX_MAP.put("Apellido Paterno", "^[A-ZÁÉÍÓÚÑ ]{1,15}$");
        REGEX_MAP.put("Apellido Materno", "^[A-ZÁÉÍÓÚÑ ]{1,15}$");
        REGEX_MAP.put("Fecha de nacimiento", "^(?:0?[1-9]|[12]\\d|3[01])([-/])(?:0?[1-9]|1[0-2])\\1(?:(?:\\d{2})?\\d{2})$");
        REGEX_MAP.put("RFC", "^[A-Z]{4}\\d{6}[A-Z0-9]{3}$");
        REGEX_MAP.put("CURP", "^[A-Z]{4}\\d{6}[HM][A-Z]{2}[A-Z]{3}[A-Z0-9]{2}$");
        REGEX_MAP.put("Calle", "^[A-Z0-9 ]+$");
        REGEX_MAP.put("Número Ext.", "^\\d+$");
        REGEX_MAP.put("Colonia", "^[A-Z0-9 ]+$");
        REGEX_MAP.put("Código Postal", "^\\d{5}$");
        REGEX_MAP.put("Teléfono1", "^\\d{3}$");
        REGEX_MAP.put("Teléfono2", "^\\d{3}$");
        REGEX_MAP.put("Teléfono3", "^\\d{4}$");
        REGEX_MAP.put("Correo electrónico", "^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9]+(?:[.-][a-zA-Z0-9]+)*\\.[a-zA-Z]{2,}$");
        REGEX_MAP.put("Contraseña", "^(?=.*[a-z])(?=.*[A-Z])(?=(?:.*\\d){2})(?=.*[\\W_]).{8,}$");
        REGEX_MAP.put("Tarjeta1", "^\\d{4}$");
        REGEX_MAP.put("Tarjeta2", "^\\d{4}$");
        REGEX_MAP.put("Tarjeta3", "^\\d{4}$");
        REGEX_MAP.put("Tarjeta4", "^\\d{4}$");
    }
```

### Continue to solve the pivot table

It seems that the problem was that I wrote FOREIGN KEY before specifying the type. It is actually backwards: first I declare the type, then I tell postgres that it is a foreign key.

In [8]:
plan_subjects_pivot_table = """
DROP TABLE IF EXISTS plan_subjects CASCADE;

CREATE TABLE plan_subjects(
    plan_id INTEGER,
    subject_id INTEGER,
    FOREIGN KEY (plan_id) REFERENCES study_plans(id),
    FOREIGN KEY (subject_id) REFERENCES subjects(id)
);
"""

conn_to_postgres(plan_subjects_pivot_table)

I forgot to put the area of specialization in the subjects table, and as I wanted to update it with the name of the study plan it belongs to (I suppose that is what is meant, maybe it means that it is from the 4 areas of the unam: mathematics, biology, social and humanities). I think there shouldn't be a problem to drop on cascade, as I still do not have data; and when I have it I should store it in an outside csv to not struggle with it later. 

Error: cannot drop table subjects because other objects depend on it
DETAIL:  constraint plan_subjects_subject_id_fkey on table plan_subjects depends on table subjects
HINT:  Use DROP ... CASCADE to drop the dependent objects too.

It seems that I just need to put CASCADE at the end of the command of dropping the table. 

It worked! But while I was dropping the subjects table I got the error 

Error: there is no unique constraint matching given keys for referenced table "study_plans"

And this makes sense to me: how can the database know from all the available names the ones I want to reference? I supposed that when I inserted the data the name itself would look for any direct match with the study_plans table... 

While it makes sense to me that two different subjects cannot share name (if they did, the subject would be the same), it makes sense that postgres is telling me about the lack of specificity. 

I think an answer could be to point it out to my study_plans table.

### The 4th requirement is

4. Se debe registrar la información académica previa del estudiante como: institución de origen, tipo de bachillerato, promedio del último bachillerato, fecha de egreso, ubicación.

I assume this will be a table one to many (one student to all the attributes in the information).

In [9]:

student_info_table = """
DROP TABLE IF EXISTS student_info CASCADE;

CREATE TABLE student_info(
    origin VARCHAR(100),
    type_school TEXT,
    average FLOAT,
    graduation DATE,
    location TEXT,
    student_id INTEGER UNIQUE,
    FOREIGN KEY (student_id) REFERENCES students(id)
);
"""
conn_to_postgres(student_info_table)

Now I will create the nationalities table. On my Java table I just have two letter codes for countries, so I will just use VARCHAR(2). I did the same mistake as before of not specifying that the code is unique. I need to explicitly put it when I am not referencing a SERIAL id (as SERIAL already ensures that it is impossible for 2 numbers to be equal)

In [10]:
nationalities_table = """ 
DROP TABLE IF EXISTS nationalities CASCADE;

CREATE TABLE nationalities(
    id SERIAL PRIMARY KEY, 
    name VARCHAR(100) NOT NULL,
    code VARCHAR(2) UNIQUE
);
"""

conn_to_postgres(nationalities_table)

### Now the fifth point is 

5. Se debe registrar la información académica en la universidad: clave de estudiante, carrera, programa de estudios, fecha de ingreso, semestre actual, estatus (activo, baja temporal, baja definitiva, graduado, titulado), fecha de última actualización, tipo de alumno (regular, irregular), correo institucional, número de créditos obtenidos hasta el momento, método de titulación. El correo institucional es único.

As I created a student info, I think I should also create another table with the university information... I don't know if I should, as student_info is not horribly large. I don't know if there is any consensus on how many attributes should a table have.

In [11]:
student_college_info_table = """
DROP TABLE IF EXISTS student_college_info CASCADE; 

CREATE TABLE student_college_info(
    student_id PRIMARY KEY, 
    career VARCHAR(100),
    code VARCHAR(10), 
    beginning DATE,
    semester INTEGER,
    status BOOLEAN, 
    regularity BOOLEAN,
    ins_email VARCHAR(20) UNIQUE,
    credits INTEGER, 
    titulation BOOLEAN,
    FOREIGN KEY (student_id) REFERENCES students(id),
    FOREING KEY (career) REFERENCES study_plans(name)
);
"""

For now I put status and titulation as a boolean type, the problem is that they are not binary decisions. I have heard that postgreSQL allows you to have custom data types. I should probably just pick one that allows me for more options and force the insertion of data on the website to match one of the available options. 

It seems that Enums might be the ones I am looking for, as they restrict the colum to follow a static list of values. 

Composite types are interesting too, as I might use them with the location of a student to simplify the zip code, state, etc. 

I will start with status... the command can go on Python or it necessarily has to

In [12]:
status_type = """ 
CREATE TYPE status AS ENUM('active', 'temporal_leave', 'definite_leave', 'graduated', 'titulated');
"""

conn_to_postgres(status_type)

Error: type "status" already exists

It is taking quite a while, so it might not work directly from Python. The problem was that I wrote the table subject_plans wrong and that was stopping everything from running. Also I notice that I forgot the quotation marks around the options of ENUM. Now it works! 

I would like to have a visual tool to follow my tables, as they have become quite complex and I am not able to follow their connections in my mind. If I keep struggling I will just draw them out in a piece of paper for reference. I like how they were arranged in Supabase though.

I will continue for now with titulation... the problem is that Mario didn't put the types I should include. There are twelve of them.

In [13]:
titulation_type = """ 
CREATE TYPE titulation AS ENUM('support_docency',
'investigation_activity',
'amplification_knowledge',
'postgrade_studies', 
'general_exam',
'academic_article',
'titulation_seminar',
'social_service',
'thesis', 
'dissertation',
'academic_level',
'professional_work'
);
"""

conn_to_postgres(titulation_type)

Error: type "titulation" already exists

It is done. Now I have to copy the student_college_info here, as these types need to exist before I create the table.

In [64]:
student_college_info_table = """
DROP TABLE IF EXISTS student_college_info CASCADE; 

CREATE TABLE student_college_info(
    student_id INTEGER, 
    career_id INTEGER,
    code VARCHAR(10), 
    beginning DATE,
    semester INTEGER,
    status STATUS, 
    regularity BOOLEAN,
    ins_email TEXT UNIQUE,
    credits INTEGER, 
    titulation TITULATION,
    FOREIGN KEY (student_id) REFERENCES students(id),
    FOREIGN KEY (career_id) REFERENCES study_plans(id)
);
"""

conn_to_postgres(student_college_info_table)

Error: the last operation didn't produce records (command status: DROP TABLE)

### The sitxh point is 

6. Se debe guardar el historial de cursos que ha tomado el estudiante: nombre de materia, calificación, semestre en que se cursó la materia, tipo acreditación (ordinaria, extraordinaria). Un alumno no puede inscribirse más de dos veces a un curso.

The thing here is that I don't know what to call this table, as subjects is already taken. Probably taken_subjects is a good name.

In [76]:
taken_subjects_table = """ 
DROP TABLE IF EXISTS taken_subjects CASCADE;

CREATE TABLE taken_subjects(
    id SERIAL PRIMARY KEY,
    student_id INTEGER, 
    subject_id INTEGER,
    score FLOAT,
    semester INTEGER,
    acreditation BOOLEAN,
    FOREIGN KEY (student_id) REFERENCES students(id),
    FOREIGN KEY (subject_id) REFERENCES subjects(id)
);
"""

conn_to_postgres(taken_subjects_table)

Error: the last operation didn't produce records (command status: DROP TABLE)

I don't understand this error... I have already put the unique tag in subjects

Error: there is no unique constraint matching given keys for referenced table "subjects"

What I don't know is how to prevent that a student is not able to enter two times the same course. First of all this doesn't work in real life (anyone who failed a core subject would be completely uncapable of graduating), but I don't know if it means the same subject at the same semester, as it would make sense to prevent redundancy. Maybe taken_subjects could have a one to many relationship in which it had all the ids of the students that took the class, and force each of them to be unique? But then I would need another pivot table called student_subjects... hadn't I needed pivot tables just for many to many?

In [16]:
student_subjects_table = """ 
DROP TABLE IF EXISTS student_subjects CASCADE;

CREATE TABLE student_subjects(
    student_id INTEGER,
    subject_id INTEGER,
    FOREIGN KEY (student_id) REFERENCES students(id),
    FOREING KEY (subject_id) REFERENCES subjects(id)
);
"""

### The seventh point is 

7. Se debe llevar registro de los examenes extraordinarios que han presentado los estudiantes (materia, fecha, calificación).

As this is just one requirement it feels excessive to create a whole new table just for the extraordinary tests... but it also seems clean. I would just need to reference each student and the subject. In case I wanted to see all the test that a student took I would just need to query for its ID

In [17]:
extraordinary_tests_table = """ 
DROP TABLE IF EXISTS extraordinary_tests CASCADE; 

CREATE TABLE extraordinary_tests(
    student_id INTEGER,
    subject_id INTEGER,
    date DATE,
    score FLOAT,
    FOREIGN KEY (student_id) REFERENCES students(id),
    FOREIGN KEY (subject_id) REFERENCES subjects(id)
);
"""

conn_to_postgres(extraordinary_tests_table)

### The eigth point says that

8. Se debe llevar registro de los tutores de los estudiantes. Un estudiante sólo puede tener un tutor, pero un profesor puede tener varios tutorados.

As I already have the students table, I should probably a professors table. Just like I did with PAPIME I probably should have a generic role like individual and allow the same table to fill different kind of information depending of it is a professor or a student. 

This works well for authentication, but I don't know if it would make my schema confusing or disorganized. 

For now I will start with the teacher table, as while it is not declared explicitly, at least in the ENES only the teachers can be tutors

Therefore I will jump all the way to point nine

### The ninth requirement is 

9. Se debe llevar registro de las clases que imparte cada profesor. Suponga que cada clase sólo puede ser impartida por un profesor en un semestre dado. Un profesor puede dar varios cursos al semestre.

In [18]:
professors_table = """ 
DROP TABLE IF EXISTS professors CASCADE; 

CREATE TABLE professors(
    id SERIAL PRIMARY KEY,
    first_names VARCHAR(100),
    paternal_surname VARCHAR(100),
    maternal_surname VARCHAR(100)
);
"""

conn_to_postgres(professors_table)

I am still confused at when the need for a pivot table becomes necessary, but as one professor can have several subjects, I suppose I need another pivot table... it makes sense though, as one subject can be taught by many professors as well as one professor is able to teach many subjects.

In [19]:
professors_subjects_table = """ 
DROP TABLE IF EXISTS professors_subjects CASCADE; 
DROP TABLE IF EXISTS classes CASCADE;

CREATE TABLE classes(
    professor_id INTEGER,
    subject_id INTEGER,
    semester INTEGER, 
    FOREIGN KEY (professor_id) REFERENCES professors(id),
    FOREIGN KEY (subject_id) REFERENCES subjects(id)
);
""" 

conn_to_postgres(professors_subjects_table)

As professors_subjects is a bit wordy I decided to replace it with classes, adding the semester too. 

I have just noticed that I have ids that are defined simply as INTEGERS while others are defined as SERIAL PRIMARY KEY. I assume the latter is the canonical way to do it and the former is probably preferred when I want to hand-pick the id. 

Now that the professors' tables are done, I can continue with tutors. It seems that people argue about if there is one to many or many to one relationship. 

As I was checking the students table I noticed that I haven't created a type for blood type

In [20]:
blood_type = """ 
CREATE TYPE bloodtype as ENUM(
    'A+',
    'A-',
    'B+',
    'B-',
    'O+',
    'O-',
    'AB+',
    'AB-'
);
"""

conn_to_postgres(blood_type)

Error: type "bloodtype" already exists

And I haven't done it with civil status either...

In [21]:
marital_status_type = """ 
CREATE TYPE maritalstatus AS ENUM(
    'Single', 
    'Married',
    'Divorced',
    'Widowed',
    'Separated'
);
"""

conn_to_postgres(marital_status_type)

Error: type "maritalstatus" already exists

In [22]:
tutors_table = """ 
DROP TABLE IF exists tutors CASCADE; 

CREATE TABLE tutors(
    student_id INTEGER,
    professor_id INTEGER,
    FOREIGN KEY (student_id) REFERENCES students(id),
    FOREIGN KEY (professor_id) REFERENCES professors(id)
);
""" 

conn_to_postgres(tutors_table)

### The final requirement is

10. Las tablas de la base deben estar en la tercera forma normal. Si este no es el caso, deberá justificarse el razonamiento para no llevar la tabla a esa forma.

I think I have already done quite a good job respecting 3rd Normal Form, however I just began to have doubts, as I think that the name field that I put on students should be separated by first_name, paternal_name and maternal_name, as that would make querying easier. 

I think I should begin putting the information to the database, but before that I would really like to have a more user-friendly way to visualize my data besides the terminal. I will check if supabase has an integration with GitHub, and if it hasn't, I will just copy and paste the SQL commands directly there. 

# Implementation

## Data

### 2 Study Plans

#### Technology
I need to fill

```SQL
    id SERIAL PRIMARY KEY,
    name VARCHAR(100) UNIQUE,
    code VARCHAR(50),
    duration INTEGER,
    credits INTEGER,
    status BOOLEAN NOT NULL
```

id: 1
name: undergraduate in technology
code: 126
duration: 8
credits: 372
status: 1 (vigente)

#### Neuroscience

id: 2
name: undergraduate in neurosciences
code: 127
duration: 8
credits: 392
status: 1 (vigente)

In [ ]:

study_plans_query = """ 
INSERT INTO study_plans(name, code, duration, credits,status)
VALUES
    ('undergraduate in technology', '126', 8, 372, TRUE), 
    ('undergraduate in neurosciences', '127', 8, 392, TRUE)
""" 

conn_to_postgres(study_plans_query)

Error: duplicate key value violates unique constraint "study_plans_name_key"
DETAIL:  Key (name)=(undergraduate in technology) already exists.

It seems that when you insert values directly you need to specify if something is a string or not. It seems that the plans do exist now, but why I can't see their values? Do I need to use DBeaver?

In [48]:
conn_to_postgres("SELECT * FROM study_plans;")

(1, 'undergraduate in technology', '126', 8, 372, True)
(2, 'undergraduate in neurosciences', '127', 8, 392, True)

### 10 subjects per study plan

I don't know what I did with subjects, as I took out the connection to postgres and when I returned it marked the error. Next time I will put an X or another uncommon character to find my tables quickly, as having a descriptive name is useful for readability but it is annoying to realize I have 55 'subjects' appearances on this file alone. 

```SQL
    ID SERIAL PRIMARY KEY,
    name VARCHAR(100) UNIQUE,
    theorical_hours INTEGER,
    practical_hours INTEGER,
    hours INTEGER,
    credits INTEGER,
    area VARCHAR(100),
    FOREIGN KEY (area) REFERENCES plan_subjects(plan_id),
    CONSTRAINT hours CHECK (theorical_hours + practical_hours <= hours)
```

#### Technology

##### Calculo I

ID: 1
name: Calculo I 
theorical_hours: 80 
practical_hours: 0 
hours: 80 
credits: 10 
area: Matematicas

##### Algebra lineal

id: 2
name: Algebra Lineal y Geometria Analitica 
theorical_hours: 48 
practical_hours: 0 
hours: 48 
credits: 6 
area: Matematicas

##### Quimica inorganica

id: 3
name: Quimica Inorganica 
theorical_hours: 64 
practical_hours: 32 
hours: 96 
credits: 10 
area: Quimica

##### Biologia general

id: 4
name: Biologia General 
theorical_hours: 64 
practical_hours: 32 
hours: 96 
credits: 10 
area: Biologia

##### Aprendizaje y creatividad

id: 5
name: Tecnicas de Aprendizaje y Creatividad 
theorical_hours: 80 
practical_hours: 0 
hours: 80 
credits: 10 
area: Sociales

##### Calculo II

id: 6
name: Calculo II 
theorical_hours: 80 
practical_hours: 0 
hours: 80 
credits: 10 
area: Matematicas

##### Mecanica clasica

id: 7
name: Mecanica Clasica 
theorical_hours: 64 
practical_hours: 32 
hours: 96 
credits: 10 
area: Fisica

##### Quimica organica

id: 8
name: Quimica Organica 
theorical_hours: 64 
practical_hours: 32 
hours: 96 
credits: 10 
area: Quimica

##### Ecuaciones diferenciales I

id: 9
name: Ecuaciones Diferenciales I 
theorical_hours: 64 
practical_hours: 0 
hours: 64 
credits: 8 
area: Matematicas

##### Computacion I

id: 10
name: Computacion I 
theorical_hours: 48 
practical_hours: 32 
hours: 80 
credits: 8 
area: Computo

#### Neurosciences

##### Matematicas I

id: 11
name: Matematicas I 
theorical_hours: 96 
practical_hours: 0 
hours: 96 
credits: 12 
area: Ciencias Basicas

##### Fisicoquimica

id: 12
name: Fisicoquimica 
theorical_hours: 96 
practical_hours: 0 
hours: 96 
credits: 12 
area: Ciencias Basicas

##### Biologia celular

id: 13
name: Biologia Celular 
theorical_hours: 64 
practical_hours: 0 
hours: 64 
credits: 8 
area: Ciencias Basicas

##### Morfologia de los sistemas

id: 14
name: Morfofisiologia de los Sistemas 
theorical_hours: 96 
practical_hours: 0 
hours: 96 
credits: 12 
area: Neurobiologico

##### Neuroanatomia funcional

id: 15
name: Neuroanatomia Funcional 
theorical_hours: 64 
practical_hours: 0 
hours: 64 
credits: 8 
area: Neurobiologico

##### Histologia y microscopia

id: 16
name: Histologia y Microscopia 
theorical_hours: 0 
practical_hours: 160 
hours: 160 
credits: 10 
area: Ciencias Basicas

##### Biofisica

id: 17
name: Biofisica 
theorical_hours: 64 
practical_hours: 0 
hours: 64 
credits: 8 
area: Ciencias Basicas

##### Matematicas II

id: 18
name: Matemáticas II 
theorical_hours: 64 
practical_hours: 0 
hours: 64 
credits: 8 
area: Ciencias Básicas

##### Bioquimica

id: 19
name: Bioquímica 
theorical_hours: 96 
practical_hours: 0 
hours: 96 
credits: 12 
area: Ciencias Básicas

##### Introduccion a las neurociencias

id: 20
name: Introducción a las Neurociencias 
theorical_hours: 96 
practical_hours: 0 
hours: 96 
credits: 12 
area: Neurobiológico

In [ ]:
subjects_query = """ 
INSERT INTO subjects(name, theorical_hours, practical_hours, hours, credits, area, career)
VALUES
    ('Calculo I', 80, 0, 80, 10, 'Matematicas', 1),
    ('Algebra Lineal y Geometria Analitica', 48, 0, 48, 6, 'Matematicas', 1), 
    ('Quimica Inorganica', 64, 32, 96, 10, 'Quimica', 1),
    ('Biologia General', 64, 32, 96, 10, 'Biologia', 1), 
    ('Tecnicas de Aprendizaje y Creatividad', 80, 0, 80, 10, 'Sociales', 1),
    ('Calculo II', 80, 0, 80, 10, 'Matematicas', 1),
    ('Mecanica Clasica', 64, 32, 96, 10, 'Fisica', 1),
    ('Quimica Organica', 64, 32, 96, 10, 'Quimica', 1),
    ('Ecuaciones Diferenciales I', 64, 0, 64, 8, 'Matematicas', 1),
    ('Computacion I', 48, 32, 80, 8, 'Computo', 1),

    ('Matematicas I', 96, 0, 96, 12, 'Ciencias Basicas', 2),
    ('Fisicoquimica', 96, 0, 96, 12, 'Ciencias Basicas', 2),
    ('Biologia Celular', 64, 0, 64, 8, 'Ciencias Basicas', 2),
    ('Morfofisiologia de los Sistemas', 96, 0, 96, 12, 'Neurobiologico', 2),
    ('Neuroanatomia Funcional', 64, 0, 64, 8, 'Neurobiologico', 2),
    ('Histologia y Microscopia', 0, 160, 160, 10, 'Ciencias Basicas', 2),
    ('Biofisica', 64, 0, 64, 8, 'Ciencias Basicas', 2),
    ('Matematicas II', 64, 0, 64, 8, 'Ciencias Basicas', 2),
    ('Bioquimica', 96, 0, 96, 12, 'Ciencias Basicas', 2),
    ('Introduccion a las Neurociencias', 96, 0, 96, 12, 'Neurobiologico', 2);
"""

conn_to_postgres(subjects_query)

It seems that the reason why I can't see the data is that I have not used the fetchall() method on my conn_to_postgres function.

In [49]:
conn_to_postgres("SELECT name, career FROM subjects WHERE career = 2;")

('Matematicas I', 2)
('Fisicoquimica', 2)
('Biologia Celular', 2)
('Morfofisiologia de los Sistemas', 2)
('Neuroanatomia Funcional', 2)
('Histologia y Microscopia', 2)
('Biofisica', 2)
('Matematicas II', 2)
('Bioquimica', 2)
('Introduccion a las Neurociencias', 2)

### 5 regular and irregular students for study plan

I need twenty students on total. As it would be too much effort to find real students I will just create a python loop. 

```SQL
    ID SERIAL PRIMARY KEY,
    first_names VARCHAR(100),
    paternal_surname VARCHAR(100),
    maternal_surname VARCHAR(100), 
    nationality VARCHAR(2),
    curp VARCHAR(30), 
    birth_date DATE,
    email TEXT UNIQUE,
    telephone VARCHAR(15),
    city VARCHAR(100), 
    state VARCHAR(100), 
    street VARCHAR(100),
    external_number INTEGER,
    zip_code INTEGER,
    marital_status MARITALSTATUS,
    blood_type BLOODTYPE,
    NSS INTEGER,
    status STATUS, 
    tutor_id INTEGER,
```

In [65]:
import random
import string 

names = ['Jose', 'Mario', 'Rogelio', 'Yamil', 'Hector', 'Alicia','Paola', 'Valeria', 'Valentina', 'Maria']
surnames = ['Ramirez', 'Martinez', 'Espiritu', 'Gomez', 'Godinez', 'Coronel', 'Herrera', 'Boneta', 'Islas']
nationalities = ['MX', 'DE', 'AD', 'AR', 'AU', 'AT', 'BE', 'BO', 'BR', 'CA']
cities = ['AG', 'JAL', 'MEX', 'PUE', 'QRO'] # The city will be the capital
# of each of these states
bloodtype = ['A+','A-', 'B+','B-','O+','O-','AB+','AB-']
maritalstatus = ['Single', 'Married', 'Divorced', 'Widowed','Separated']
status_lst = ['active', 'temporal_leave', 'definite_leave', 'graduated', 'titulated']
state_dic = {'AG': 'AS', 
            'JAL': 'JC', 
            'MEX': 'CDMX',
            'PUE': 'PL',
            'QRO': 'QRO'}

def create_data(student = True, plan_id = 1, isregular = True):
    chosen_name = random.choice(names) 
    chs_pat_name = random.choice(surnames)
    chs_mat_name = random.choice(surnames)
    nationality = random.choice(nationalities)
    chs_curp = ''.join(random.choices(string.ascii_uppercase + string.digits, k = 18))
    day = str(random.randint(1, 28))
    if int(day) < 10:
        day = f"0{day}"
    month = str(random.randint(1, 12))
    year = str(2000 + random.randint(0,7))
    birth_date = f"{year}-{month}-{day}"
    email = f"{chosen_name}_{chs_pat_name}_{chs_mat_name}@gmail.com"
    telephone = random.randint(1000000000, 9999999999)
    city = random.choice(cities)
    state = state_dic[city]
    street = random.randint(1,10)
    ext_num = random.randint(1, 999)
    zipcode = random.randint(10000, 99999)
    blood_type = random.choice(bloodtype)
    marital_status = random.choice(maritalstatus)
    nss = random.randint(10000, 99999)
    tutor = random.randint(1, 10)

    if student:
        query_personal_info = """ 
            INSERT INTO students(
                first_names, paternal_surname, maternal_surname, 
                nationality, curp, birth_date, email, telephone,
                city, state, street, external_number, zip_code,
                marital_status, blood_type, NSS, tutor_id)

            VALUES (%s, %s, %s,
            %s, %s, %s, %s, %s, 
            %s, %s, %s, %s, %s, 
            %s, %s, %s, %s)

            RETURNING id; 
        """

        person_data = (chosen_name, chs_pat_name, chs_mat_name, nationality, 
        chs_curp, birth_date, email, telephone, city, state, street, ext_num,
        zipcode, marital_status, blood_type, nss, tutor)

        student_id = conn_to_postgres(query_personal_info, 
        params = person_data, fetch = True)

        query_college_info = """ 
        INSERT INTO student_college_info(
            student_id, career_id, code, beginning, semester, status, 
            regularity, ins_email, credits, titulation)
        
        VALUES(%s, %s, %s, %s, %s, %s,
               %s, %s, %s, %s);
        """

        code = random.randint(100000000, 999999999)
        beginning = str(int(birth_date[:4]) + 20) + birth_date[4:]
        ins_email = f"{chosen_name}.{code}@comunidad.unam.mx"
        status = random.choice(status_lst)

        college_data = (student_id, plan_id, code, beginning, 1,
        status, True, ins_email, 0, None)

        conn_to_postgres(query_college_info, college_data)

    else:
        professor_query = """
        INSERT INTO professors(
            first_names,
            paternal_surname,
            maternal_surname)

        VALUES (%s, %s, %s)
        """
        
        professor_data = (chosen_name, chs_pat_name, chs_mat_name)

        conn_to_postgres(professor_query, professor_data)

plan_ids = [1, 2]

for _ in range(10):
    create_data(student = False) # Professors

for plan in plan_ids:
    for _ in range(5):
        create_data(plan_id = plan) # Technology and Neuroscience regulars
    for _ in range(5):
        create_data(plan_id = plan, isregular = False) # Technology and Neuroscience iregulars

Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)
Error: the last operation didn't produce records (command status: INSERT 0 1)

I got NameError: name 'string' is not defined from the chs_curp, but I don't understand why. The `string` module indeed exists in python and it is already built in... 

It is not about me picking random.choices instead of random.choice either... I assume I need to import the module, which doesn't sound right, as I have never had trouble using string methods before. 

Importing the module did change the type of error though. Now it says TypeError: str.join() takes no keyword arguments. I know see what it is, I was puting the number of choices that random should take outside of its parentheses. As the join method thought that I was giving him a keyword argument he got confused. 

The other mistake I was having was that I was writing radint instead of ra**n**dint. The n was missing. 

Now I am having trouble with the %s placeholders. It seems that placeholder just works with strings, and that %I is used for an SQL identifier (which I don't think I need, as students and professors have a SERIAL constraint to automatically change the id). 

Now that I think about it I skipped inserting the study_plans info. I am also realizing that I don't have a connection between students and study_plans... Now I see where my confusion lies. I thought that I had mistakenly left out regularity and status from the students table, but the reality is that I did that on purpose, as it is the college_info table the one that checks for regularity, status, and the specific career that each student belongs too. students is just for their personal info (I might change the name later to make it more obvious).

It seems that %L is for a SQL literal, and that is used mainly to prevent mistakes when using single quotes. 

The documentation I am seeing works with FORMAT, which has a quite different structure that the one I tried to use. 

On other source I found that the psycopg library automaitcally converts strings into the necessary data type of the table, and that it always uses %s as a placeholder. 

I will try to work with the study plans first to see if they work. Now that I inserted the data and visualized it (I think I need to get into the habit of doing things more atomically, as I wrote a lot of data without inserting it first) I need to continue with the students data. 

It seems that I can use the RETURNING clause from postgreSQL to return the id of the student and then fill with that same id the college_info table. 

The main problem I encounter is that my conn_to_postgres function automatically closes the connection once a query is executed, and what I want is to both, store any value that RETURNING sent, and also fill the placeholder with the tuple I send. 

I got the error Error: date/time field value out of range: "13/11/2002". With a quick google search I see that the format the data type expects is YYYY-MM-DD.

I forgot to put the data in the nationalities table

```SQL
    id SERIAL PRIMARY KEY, 
    name VARCHAR(100) NOT NULL,
    code VARCHAR(2) UNIQUE
```

The good thing is that I left the nationalities table fairly short

nationalities = ['MX', 'DE', 'AD', 'AR', 'AU', 'AT', 'BE', 'BO', 'BR', 'CA']

In [ ]:
countries_query = """
INSERT INTO nationalities (code, name) 
VALUES
    ('MX', 'Mexico'), ('DE', 'Germany'), 
    ('AD', 'Andorra'), ('AR', 'Argentina'), 
    ('AU', 'Australia'), ('AT', 'Austria'), 
    ('BE', 'Belgium'), ('BO', 'Bolivia'), 
    ('BR', 'Brazil'), ('CA', 'Canada');
"""

conn_to_postgres(countries_query)

Error: the last operation didn't produce records (command status: INSERT 0 10)

In [61]:
conn_to_postgres("SELECT * FROM nationalities")

(1, 'Mexico', 'MX')
(2, 'Germany', 'DE')
(3, 'Andorra', 'AD')
(4, 'Argentina', 'AR')
(5, 'Australia', 'AU')
(6, 'Austria', 'AT')
(7, 'Belgium', 'BE')
(8, 'Bolivia', 'BO')
(9, 'Brazil', 'BR')
(10, 'Canada', 'CA')

This error 

```bash
Error: column "regularity" is of type boolean but expression is of type smallint
LINE 7:                $7, $8, $9, $10); 
```

Seems to have been caused because I put 1 on college_data, expecting it to transform the 1 to True, but as the value is sent literally (which makes sense, as if it didn't I would have trouble with the plans, ids, etc) the table is filled incorrectly. 

Now that has got out of the way I got the error `Error: value too long for type character varying(20)` but on students I don't have any attribute that has VARCHAR(20). 

If I want to "solve" the problem quickly I can just use TEXT, as it seems is literally the same as VARCHAR but the latter forces itself to n characters. An unexpectedly long string could be of the email, so I think that will be the reason my code is breaking. 

Indeed `ins_email VARCHAR(20) UNIQUE` has only 20 characters. 

Now I just have `Error: the last operation didn't produce records (command status: INSERT 0 1)` which I don't think it is a problem, as it is just telling me that there wasn't anything "printed" (this is a direct consequence of the update to the RETURNING clause in my conn_to_postgres function). 

Lets see if everything is all right.

In [66]:
conn_to_postgres("SELECT * FROM students;")

(43, 'Jose', 'Coronel', 'Ramirez', 'AT', 'SSN40Q2GZWX43S6RKR', datetime.date(2003, 3, 10), 'Jose_Coronel_Ramirez@gmail.com', '6188818405', 'PUE', 'PL', '3', 360, 36135, 'Divorced', 'O+', 13674, 2, None, None)
(44, 'Hector', 'Gomez', 'Godinez', 'BR', 'EFEHP1WRUIR7W9MYMC', datetime.date(2006, 8, 19), 'Hector_Gomez_Godinez@gmail.com', '4015133972', 'QRO', 'QRO', '3', 18, 39432, 'Single', 'A+', 67705, 5, None, None)
(45, 'Rogelio', 'Coronel', 'Herrera', 'DE', 'J02CG48N9LW9GKGMKI', datetime.date(2000, 2, 9), 'Rogelio_Coronel_Herrera@gmail.com', '4694439189', 'MEX', 'CDMX', '2', 270, 86231, 'Divorced', 'A-', 75102, 1, None, None)
(46, 'Valentina', 'Godinez', 'Islas', 'AT', 'EHCMJXGZL3LDHSR16V', datetime.date(2003, 6, 12), 'Valentina_Godinez_Islas@gmail.com', '5817020173', 'JAL', 'JC', '2', 236, 22380, 'Single', 'AB+', 33952, 6, None, None)
(47, 'Valentina', 'Gomez', 'Ramirez', 'AR', 'AR07IALZ32JN20BHA4', datetime.date(2003, 8, 22), 'Valentina_Gomez_Ramirez@gmail.com', '9047120023', 'PUE', 'PL', '2', 218, 58449, 'Divorced', 'AB-', 63019, 6, None, None)
(48, 'Yamil', 'Godinez', 'Martinez', 'BO', 'WUV255Z2B1I2D1A64O', datetime.date(2005, 4, 19), 'Yamil_Godinez_Martinez@gmail.com', '3659845575', 'PUE', 'PL', '9', 415, 57618, 'Divorced', 'A-', 37052, 3, None, None)
(49, 'Maria', 'Martinez', 'Boneta', 'BO', 'HN6HPD63V7KFH2HYZO', datetime.date(2000, 5, 27), 'Maria_Martinez_Boneta@gmail.com', '9193271307', 'JAL', 'JC', '10', 640, 86220, 'Separated', 'O+', 99684, 6, None, None)
(50, 'Rogelio', 'Boneta', 'Herrera', 'BR', '9Z4BSGLPWNQTHOBB1Q', datetime.date(2002, 3, 4), 'Rogelio_Boneta_Herrera@gmail.com', '4696241329', 'QRO', 'QRO', '4', 270, 18850, 'Single', 'A-', 61628, 9, None, None)
(51, 'Maria', 'Boneta', 'Islas', 'BR', 'MRS84C8UU0VK606RVP', datetime.date(2003, 12, 1), 'Maria_Boneta_Islas@gmail.com', '3710774001', 'QRO', 'QRO', '5', 937, 21089, 'Divorced', 'O-', 96806, 5, None, None)
(52, 'Valeria', 'Coronel', 'Ramirez', 'BO', '6XO0TFFU44YNU6JP83', datetime.date(2004, 4, 24), 'Valeria_Coronel_Ramirez@gmail.com', '8515001529', 'AG', 'AS', '3', 308, 98855, 'Single', 'A-', 93044, 3, None, None)
(53, 'Jose', 'Islas', 'Ramirez', 'AU', 'JKTG0KT0NODM8QKVRM', datetime.date(2000, 9, 8), 'Jose_Islas_Ramirez@gmail.com', '3901793772', 'MEX', 'CDMX', '3', 578, 22984, 'Widowed', 'A+', 45626, 3, None, None)
(54, 'Rogelio', 'Boneta', 'Coronel', 'BE', '5A8S2GPFS66AGHBK1T', datetime.date(2007, 1, 4), 'Rogelio_Boneta_Coronel@gmail.com', '6460306309', 'JAL', 'JC', '6', 786, 65885, 'Divorced', 'O+', 87228, 7, None, None)
(55, 'Paola', 'Godinez', 'Godinez', 'BE', 'S6WPBUELVXRBD7AZ6P', datetime.date(2002, 2, 21), 'Paola_Godinez_Godinez@gmail.com', '8266303182', 'AG', 'AS', '2', 655, 85909, 'Married', 'B-', 18911, 8, None, None)
(56, 'Maria', 'Herrera', 'Herrera', 'AT', '7GYQ3VSRLQHK3UKHJF', datetime.date(2002, 11, 14), 'Maria_Herrera_Herrera@gmail.com', '4114384273', 'QRO', 'QRO', '7', 599, 64621, 'Widowed', 'B-', 76011, 9, None, None)
(57, 'Paola', 'Boneta', 'Herrera', 'AU', 'VBGLW8KA0PJWW0IKQ6', datetime.date(2003, 9, 3), 'Paola_Boneta_Herrera@gmail.com', '4284144307', 'QRO', 'QRO', '6', 28, 85068, 'Married', 'O-', 57965, 9, None, None)
(58, 'Paola', 'Martinez', 'Gomez', 'DE', 'VH2IFET04AURYQG1CF', datetime.date(2004, 8, 9), 'Paola_Martinez_Gomez@gmail.com', '9537231420', 'JAL', 'JC', '1', 691, 55376, 'Married', 'B-', 26580, 3, None, None)
(59, 'Mario', 'Martinez', 'Martinez', 'AU', '4MI8ZUBH9B46KRGNRA', datetime.date(2005, 9, 22), 'Mario_Martinez_Martinez@gmail.com', '7940322155', 'QRO', 'QRO', '1', 519, 94370, 'Widowed', 'AB+', 21587, 2, None, None)
(60, 'Valentina', 'Gomez', 'Coronel', 'BR', 'MQEIRH98WQ772AJFT0', datetime.date(2001, 2, 10), 'Valentina_Gomez_Coronel@gmail.com', '6814329526', 'AG', 'AS', '8', 574, 82922, 'Divorced', 'O+', 51130, 5, None, None)
(61, 'Alicia', 'Coronel', 'Islas', 'CA', 'RII93OK3CU3SX3K2IG', datetime.date(2000, 9, 17), 'Alicia_Coronel_Islas@gmail.com', '8648687931', 'QRO', 'QRO', '3', 763, 62589, 'Divorced', 'AB+', 92911, 2, None, None)
(62, 'Valeria', 'Islas', 'Martinez', 'BO', '1ITCHFBM5A5HEIHQLB', datetime.date(2001, 10, 8), 'Valeria_Islas_Martinez@gmail.com', '2154905494', 'QRO', 'QRO', '3', 499, 21200, 'Widowed', 'AB-', 78310, 8, None, None)
(63, 'Valeria', 'Boneta', 'Boneta', 'CA', 'D4RHUK2PYUW9TDA487', datetime.date(2005, 7, 21), 'Valeria_Boneta_Boneta@gmail.com', '7470479177', 'QRO', 'QRO', '8', 243, 82596, 'Single', 'A-', 51936, 10, None, None)
(64, 'Jose', 'Boneta', 'Godinez', 'AT', '9D5KSHFEOF3LHYV12D', datetime.date(2001, 4, 5), 'Jose_Boneta_Godinez@gmail.com', '4398670983', 'QRO', 'QRO', '8', 502, 33591, 'Married', 'O-', 83125, 6, None, None)
(65, 'Yamil', 'Gomez', 'Coronel', 'AU', '6VJ3R5K77YBFCTBJUY', datetime.date(2000, 8, 6), 'Yamil_Gomez_Coronel@gmail.com', '7786033125', 'MEX', 'CDMX', '8', 776, 93030, 'Married', 'A-', 82778, 1, None, None)
(66, 'Valentina', 'Espiritu', 'Coronel', 'CA', 'DVEIT4IOOGJGFZG2W8', datetime.date(2002, 7, 21), 'Valentina_Espiritu_Coronel@gmail.com', '9079068085', 'QRO', 'QRO', '8', 335, 87210, 'Separated', 'O-', 46788, 10, None, None)
(67, 'Rogelio', 'Islas', 'Herrera', 'AD', 'SKXCL1Q6O34VCBAD49', datetime.date(2004, 1, 2), 'Rogelio_Islas_Herrera@gmail.com', '3107983110', 'JAL', 'JC', '10', 214, 49167, 'Divorced', 'A+', 72027, 9, None, None)
(69, 'Mario', 'Gomez', 'Boneta', 'AR', 'P38WAV3TJ5JP671U0F', datetime.date(2003, 1, 25), 'Mario_Gomez_Boneta@gmail.com', '2432271155', 'AG', 'AS', '3', 700, 95873, 'Married', 'AB+', 99857, 8, None, None)
(70, 'Yamil', 'Martinez', 'Godinez', 'AR', 'MZ1LSBQNQS3AP7C8YX', datetime.date(2004, 11, 21), 'Yamil_Martinez_Godinez@gmail.com', '6581013199', 'JAL', 'JC', '7', 257, 98800, 'Married', 'A-', 40654, 3, None, None)
(71, 'Maria', 'Martinez', 'Islas', 'AT', '16E4L8XP3QRP4WS68I', datetime.date(2000, 12, 18), 'Maria_Martinez_Islas@gmail.com', '3536382072', 'QRO', 'QRO', '4', 340, 83689, 'Married', 'O-', 40540, 5, None, None)
(72, 'Mario', 'Ramirez', 'Gomez', 'AD', 'K8Q1HI916O7LDURC74', datetime.date(2003, 5, 17), 'Mario_Ramirez_Gomez@gmail.com', '2465954022', 'QRO', 'QRO', '8', 32, 42997, 'Divorced', 'O-', 21760, 10, None, None)
(73, 'Rogelio', 'Islas', 'Ramirez', 'BO', 'TKFFWLWQQ731PMVMMP', datetime.date(2000, 3, 3), 'Rogelio_Islas_Ramirez@gmail.com', '2576756755', 'JAL', 'JC', '8', 12, 44368, 'Separated', 'B+', 94842, 8, None, None)
(74, 'Valeria', 'Herrera', 'Coronel', 'DE', 'QUKSJM7STEOI9KEKBG', datetime.date(2004, 8, 20), 'Valeria_Herrera_Coronel@gmail.com', '2985089815', 'PUE', 'PL', '7', 151, 49120, 'Divorced', 'O-', 91641, 1, None, None)
(75, 'Valentina', 'Espiritu', 'Herrera', 'CA', '0DQHAMTM7E9ADX9RAN', datetime.date(2003, 9, 10), 'Valentina_Espiritu_Herrera@gmail.com', '3253104088', 'MEX', 'CDMX', '6', 475, 26172, 'Separated', 'B-', 21738, 2, None, None)
(76, 'Valentina', 'Ramirez', 'Godinez', 'AR', 'XX94J7CHF78MEQXQE1', datetime.date(2007, 5, 15), 'Valentina_Ramirez_Godinez@gmail.com', '3914961750', 'MEX', 'CDMX', '8', 97, 17696, 'Married', 'O+', 19390, 7, None, None)
(77, 'Valentina', 'Godinez', 'Ramirez', 'AR', '7EQW6RFA0ICBYDYJ14', datetime.date(2006, 3, 16), 'Valentina_Godinez_Ramirez@gmail.com', '7554873962', 'MEX', 'CDMX', '9', 118, 98539, 'Separated', 'A-', 31312, 3, None, None)
(78, 'Maria', 'Islas', 'Martinez', 'AT', 'EP661AVYDEXE91XJET', datetime.date(2006, 11, 4), 'Maria_Islas_Martinez@gmail.com', '6269304557', 'QRO', 'QRO', '4', 15, 34044, 'Single', 'AB-', 59671, 6, None, None)
(79, 'Rogelio', 'Espiritu', 'Boneta', 'DE', 'UKYEJXTX652HBFAGSR', datetime.date(2004, 11, 18), 'Rogelio_Espiritu_Boneta@gmail.com', '7655308988', 'QRO', 'QRO', '6', 858, 85157, 'Divorced', 'A+', 32260, 2, None, None)
(80, 'Jose', 'Godinez', 'Martinez', 'BO', 'MXKP78L79P1RM1V9RR', datetime.date(2004, 1, 10), 'Jose_Godinez_Martinez@gmail.com', '3595070814', 'PUE', 'PL', '3', 266, 58890, 'Divorced', 'A+', 79322, 2, None, None)
(81, 'Alicia', 'Godinez', 'Ramirez', 'BE', 'BHN0IXA9PXRAKDIJDI', datetime.date(2007, 7, 23), 'Alicia_Godinez_Ramirez@gmail.com', '8441923289', 'QRO', 'QRO', '1', 342, 96977, 'Single', 'B-', 45205, 2, None, None)
(82, 'Jose', 'Coronel', 'Godinez', 'CA', 'CN9XS8CYBN7FLHGAJ9', datetime.date(2000, 2, 7), 'Jose_Coronel_Godinez@gmail.com', '1701587896', 'QRO', 'QRO', '4', 976, 87315, 'Separated', 'B-', 81437, 5, None, None)
(83, 'Valentina', 'Gomez', 'Boneta', 'AU', 'BA4C69Q2J1OPBJPBAV', datetime.date(2006, 2, 15), 'Valentina_Gomez_Boneta@gmail.com', '9696364938', 'MEX', 'CDMX', '8', 320, 67497, 'Single', 'A+', 99922, 9, None, None)
(84, 'Alicia', 'Islas', 'Boneta', 'BR', 'ZIGKJ6AVQGOPJG0W1E', datetime.date(2004, 8, 20), 'Alicia_Islas_Boneta@gmail.com', '2374075387', 'JAL', 'JC', '6', 23, 35697, 'Separated', 'O+', 68348, 7, None, None)
(85, 'Hector', 'Boneta', 'Martinez', 'AD', 'GX1M10TGXPVKYHRLNM', datetime.date(2007, 7, 27), 'Hector_Boneta_Martinez@gmail.com', '9297446053', 'QRO', 'QRO', '7', 552, 94481, 'Widowed', 'A-', 16306, 4, None, None)
(86, 'Rogelio', 'Coronel', 'Godinez', 'BE', '7J0ZFJZWRVWCMWKDED', datetime.date(2004, 7, 5), 'Rogelio_Coronel_Godinez@gmail.com', '8112546393', 'JAL', 'JC', '2', 258, 61127, 'Married', 'AB-', 92746, 10, None, None)
(87, 'Rogelio', 'Coronel', 'Espiritu', 'CA', 'D7LK077KNRM3ST1ZG7', datetime.date(2004, 2, 20), 'Rogelio_Coronel_Espiritu@gmail.com', '9455137695', 'JAL', 'JC', '2', 224, 59630, 'Married', 'A-', 60373, 1, None, None)
(88, 'Valentina', 'Boneta', 'Gomez', 'BO', 'NJJSD3S3CVIITPJTK9', datetime.date(2006, 6, 28), 'Valentina_Boneta_Gomez@gmail.com', '3618244632', 'AG', 'AS', '4', 725, 44271, 'Divorced', 'A-', 98342, 4, None, None)
(89, 'Valeria', 'Martinez', 'Coronel', 'BO', 'OXU5WBPO7E09PETF1U', datetime.date(2005, 5, 10), 'Valeria_Martinez_Coronel@gmail.com', '5443090232', 'AG', 'AS', '5', 343, 37216, 'Divorced', 'AB-', 69825, 6, None, None)
(90, 'Rogelio', 'Ramirez', 'Godinez', 'AU', 'N83FO73M9OD5WMVQRQ', datetime.date(2004, 7, 17), 'Rogelio_Ramirez_Godinez@gmail.com', '3638533006', 'QRO', 'QRO', '3', 327, 85749, 'Widowed', 'A+', 33922, 4, None, None)
(91, 'Paola', 'Ramirez', 'Espiritu', 'BE', 'K52PHYI65N0NBP6KMB', datetime.date(2001, 11, 4), 'Paola_Ramirez_Espiritu@gmail.com', '6300428713', 'PUE', 'PL', '7', 370, 65569, 'Widowed', 'AB-', 67380, 7, None, None)
(92, 'Valeria', 'Gomez', 'Ramirez', 'AU', '6LVA3K6X1QUVUERV3V', datetime.date(2003, 8, 1), 'Valeria_Gomez_Ramirez@gmail.com', '3114142175', 'JAL', 'JC', '9', 768, 65800, 'Separated', 'B-', 97679, 3, None, None)
(93, 'Maria', 'Martinez', 'Ramirez', 'MX', 'Y7Q4RUH25G1RODAF47', datetime.date(2005, 6, 2), 'Maria_Martinez_Ramirez@gmail.com', '6416521620', 'PUE', 'PL', '4', 611, 76262, 'Divorced', 'AB+', 60682, 9, None, None)
(94, 'Valeria', 'Martinez', 'Ramirez', 'BR', 'UJ0S0XYA67P6MDR2FB', datetime.date(2005, 6, 7), 'Valeria_Martinez_Ramirez@gmail.com', '8797545039', 'PUE', 'PL', '1', 104, 94507, 'Separated', 'O+', 27531, 3, None, None)
(95, 'Rogelio', 'Martinez', 'Coronel', 'CA', 'PAFZYG15JC3NISIN0X', datetime.date(2004, 3, 23), 'Rogelio_Martinez_Coronel@gmail.com', '8025973275', 'AG', 'AS', '7', 62, 91613, 'Widowed', 'O-', 51496, 7, None, None)
(96, 'Yamil', 'Islas', 'Herrera', 'AT', '7I2O737RU6W4LLTQIA', datetime.date(2007, 5, 6), 'Yamil_Islas_Herrera@gmail.com', '1368515970', 'PUE', 'PL', '1', 636, 22982, 'Separated', 'O+', 26697, 3, None, None)
(97, 'Valeria', 'Boneta', 'Godinez', 'BO', 'I5AJ2M7FMFIIIKZ5OT', datetime.date(2005, 9, 10), 'Valeria_Boneta_Godinez@gmail.com', '3023731618', 'QRO', 'QRO', '2', 937, 10675, 'Separated', 'A-', 90247, 7, None, None)
(98, 'Valentina', 'Ramirez', 'Coronel', 'AT', 'DTR6XWWRQC87FR2EYW', datetime.date(2007, 9, 12), 'Valentina_Ramirez_Coronel@gmail.com', '5771678032', 'AG', 'AS', '4', 283, 40147, 'Widowed', 'O+', 88822, 6, None, None)
(99, 'Jose', 'Herrera', 'Islas', 'MX', '7SAKADBZ237WWF5K08', datetime.date(2002, 9, 26), 'Jose_Herrera_Islas@gmail.com', '9289485736', 'PUE', 'PL', '5', 204, 45706, 'Widowed', 'AB+', 19603, 3, None, None)
(100, 'Rogelio', 'Gomez', 'Ramirez', 'DE', 'WM0BWHX206JNYWCW64', datetime.date(2001, 10, 24), 'Rogelio_Gomez_Ramirez@gmail.com', '5914456797', 'MEX', 'CDMX', '5', 241, 67493, 'Widowed', 'A+', 14314, 3, None, None)
(101, 'Maria', 'Espiritu', 'Herrera', 'BE', '7ZPKDISE4V6LC62VKB', datetime.date(2001, 3, 3), 'Maria_Espiritu_Herrera@gmail.com', '6014547401', 'AG', 'AS', '5', 554, 87481, 'Married', 'AB-', 86545, 6, None, None)
(102, 'Hector', 'Islas', 'Ramirez', 'AR', 'CXU1Y4TJW7NOQI04F0', datetime.date(2007, 8, 11), 'Hector_Islas_Ramirez@gmail.com', '4870255731', 'PUE', 'PL', '8', 965, 75799, 'Single', 'A-', 35736, 5, None, None)

Now the data is correct! In fact, as I ran the code many times I have up to 102 students. Lets check professors now.

In [67]:
conn_to_postgres("SELECT * FROM professors;")

(1, 'Valeria', 'Islas', 'Coronel')
(2, 'Valentina', 'Islas', 'Herrera')
(3, 'Alicia', 'Islas', 'Boneta')
(4, 'Alicia', 'Ramirez', 'Gomez')
(5, 'Yamil', 'Herrera', 'Gomez')
(6, 'Mario', 'Espiritu', 'Espiritu')
(7, 'Rogelio', 'Coronel', 'Ramirez')
(8, 'Paola', 'Martinez', 'Islas')
(9, 'Jose', 'Espiritu', 'Boneta')
(10, 'Hector', 'Espiritu', 'Coronel')
(11, 'Yamil', 'Ramirez', 'Coronel')
(12, 'Jose', 'Martinez', 'Coronel')
(13, 'Paola', 'Coronel', 'Espiritu')
(14, 'Jose', 'Godinez', 'Coronel')
(15, 'Yamil', 'Boneta', 'Ramirez')
(16, 'Valeria', 'Ramirez', 'Martinez')
(17, 'Yamil', 'Coronel', 'Islas')
(18, 'Maria', 'Ramirez', 'Boneta')
(19, 'Valeria', 'Gomez', 'Boneta')
(20, 'Rogelio', 'Godinez', 'Martinez')
(21, 'Maria', 'Godinez', 'Gomez')
(22, 'Valeria', 'Coronel', 'Gomez')
(23, 'Maria', 'Gomez', 'Ramirez')
(24, 'Yamil', 'Islas', 'Islas')
(25, 'Hector', 'Espiritu', 'Ramirez')
(26, 'Hector', 'Islas', 'Coronel')
(27, 'Valentina', 'Islas', 'Islas')
(28, 'Rogelio', 'Godinez', 'Gomez')
(29, 'Jose', 'Ramirez', 'Godinez')
(30, 'Mario', 'Islas', 'Ramirez')
(31, 'Alicia', 'Gomez', 'Islas')
(32, 'Alicia', 'Herrera', 'Martinez')
(33, 'Paola', 'Ramirez', 'Gomez')
(34, 'Maria', 'Boneta', 'Espiritu')
(35, 'Jose', 'Ramirez', 'Coronel')
(36, 'Mario', 'Espiritu', 'Herrera')
(37, 'Mario', 'Islas', 'Ramirez')
(38, 'Mario', 'Espiritu', 'Boneta')
(39, 'Paola', 'Ramirez', 'Ramirez')
(40, 'Hector', 'Godinez', 'Boneta')

And indeed I have now up to 40 professors. 

Lets check if I have 5 regular and 5 irregular students in both plans.

In [69]:
conn_to_postgres("SELECT * FROM students WHERE career_id = 1 isregular = TRUE;")
conn_to_postgres("SELECT * FROM students WHERE career_id = 1 isregular = FALSE;")
conn_to_postgres("SELECT * FROM students WHERE career_id = 2 isregular = TRUE;")
conn_to_postgres("SELECT * FROM students WHERE career_id = 2 isregular = FALSE;")

Error: syntax error at or near "isregular"
LINE 1: SELECT * FROM students WHERE career_id = 1 isregular = TRUE;
                                                   ^
Error: syntax error at or near "isregular"
LINE 1: SELECT * FROM students WHERE career_id = 1 isregular = FALSE...
                                                   ^
Error: syntax error at or near "isregular"
LINE 1: SELECT * FROM students WHERE career_id = 2 isregular = TRUE;
                                                   ^
Error: syntax error at or near "isregular"
LINE 1: SELECT * FROM students WHERE career_id = 2 isregular = FALSE...
                                                   ^

### 2. La base de datos debe tener 3 tipos de usuarios:

#### a. administrador con permisos totales

I already have the schronding user that can has total permissions, but I think I will create another user called admnistrator with a specific password in order to be explicit about the requirement. 

There seems to be multiple attributes, and even an interactive mode to create the roles more easily. 

It was effortless, I just needed to say that the administrator role was a superuser... the thing is that I wonder if it is able to modify all my tables or just UNAM_database... I will probably modify all, as I didn't specified what tables should act on

```bash
sudo -i -u postgres
[sudo] password for schronding: 
postgres@debian:~$ createuser --interactive --pwprompt administrator
Enter password for new role: 
Enter it again: 
Shall the new role be a superuser? (y/n) y
```

#### b. servicios escolares con permisos de lectura para todas las tablas y escritura sólo actualizar e ingresar nuevos usuarios, pero no para eliminar.

This seems more challenging. I think these should not have the CREATEDB role attribute, but how could I prevent it from eliminating the data?...

It seems that postgres doesn't have delete by default, I can just left it out and the problem is solved. 

I will name the role school_services. 

```bash
sudo -u postgres psql
[sudo] password for schronding: 
could not change directory to "/home/schronding/repos/UNAM_database": Permission denied
psql (15.15 (Debian 15.15-0+deb12u1))
Type "help" for help.

postgres=# CREATE ROLE school_services LOGIN PASSWORD '987654321';
CREATE ROLE
postgres=# \du
postgres=# \l
postgres=# GRANT SELECT, INSERT, UPDATE ON unam_database TO school_services; 
ERROR:  relation "unam_database" does not exist
```

I have doubt here. The documentation I found talked about using a table_name, not a whole database. It makes sense that school_services can only act on the tables related to students... but as I have created quite a lot of tables, I would need to grant access to each of them. 

It seems that indeed I need to use the CONNECT clause along the database name. I also need to grant usage on the public schema. 

```bash
postgres=# GRANT CONNECT ON DATABASE unam_database TO administrator;
GRANT
postgres=# GRANT USAGE ON SCHEMA public TO administrator; 
GRANT
postgres=# GRANT CONNECT ON DATABASE unam_database TO school_services;
GRANT
postgres=# GRANT USAGE ON SCHEMA public TO school_services; 
GRANT
```

Now lets try again and see if it works... I need to put the name of the tables that it has access. 

I have a repeated table 

```bash

                 List of relations
 Schema |         Name         | Type  |   Owner    
--------+----------------------+-------+------------
 public | classes              | table | schronding
 public | extraordinary_tests  | table | schronding
 public | nationalities        | table | schronding
 public | plan_subjects        | table | schronding
 public | professors           | table | schronding
 public | student_college_info | table | schronding
 public | student_info         | table | schronding
 public | students             | table | schronding
 public | study_plan           | table | schronding
 public | study_plans          | table | schronding
 public | subjects             | table | schronding
 public | taken_subjects       | table | schronding
 public | tutors               | table | schronding
 ```

It seems that it is just a table I forgot to delete. 

It seems it is done

```bash
sudo -u postgres psql
\c unam_database
unam_database=# GRANT INSERT, UPDATE, SELECT, DELETE ON classes, extraordinary_tests, nationalities, plan_subjects, professors, student_college_info, student_info, students, study_plans, subjects, taken_subjects, tutors TO administrator;
GRANT
```

In [ ]:
#conn_to_postgres("DROP TABLE IF EXISTS study_plan CASCADE;")

(1, 'undergraduate in technology', '126', 8, 372, True)
(2, 'undergraduate in neurosciences', '127', 8, 392, True)

Now that study_plan is eliminated I know I have twelve tables. 

Lets do the same with school_services... should I really grant the INSERT, UPDATE and SELECT permissions on all the tables? The ones that seem relevant to them are:

extraordinary_tests, student_college_info, student_info, students, and taken_subjects

the other tables seem more concerned with professors and coordinators.

#### c. coordinador de carrera con permisos de lectura sólo sobre la información de los alumnos de la carrera correspondiente y la información de todos los profesores.

In order for this to work I would need to limit the access of each of the coordinators (as I have to study plans) to just the id of their career. I think I could use a view to acocmplish this, as I could just use the WHERE clause with career_id = 1 (or two, if it was the coordinator of neurosciences).

In [73]:
technology_view = """ 
CREATE VIEW technology_students AS
SELECT *
FROM student_college_info
WHERE career_id = 1;
"""

neurosciences_view = """ 
CREATE VIEW neuroscience_students AS
SELECT *
FROM student_college_info
WHERE career_id = 2;
"""

conn_to_postgres(technology_view)
conn_to_postgres(neurosciences_view)

Error: relation "technology_students" already exists
Error: the last operation didn't produce records (command status: CREATE VIEW)

Now I would just need to grant select on the view... but here is where I wonder if my decision to separate the college info into a separate table was wise. Can the coordinator access students with just the ids?  

For now I will create the roles for the coordinators. 

```bash
unam_database=# CREATE ROLE technology_coordinator WITH LOGIN PASSWORD '';
CREATE ROLE
unam_database=# CREATE ROLE neurosciences_coordinator WITH LOGIN PASSWORD '';
CREATE ROLE
```

I didn't put the passwords for terms of security. 

It seems that the correct way to display all the information that the coordinator needs I should use the JOIN clause.

In [74]:
technology_view = """ 
CREATE OR REPLACE VIEW technology_students AS
SELECT
    t1.id,
    t1.first_names,
    t1.paternal_surname,
    t1.maternal_surname, 
    t2.semester,
    t2.status,
    t2.regularity,
    t2.credits,
    t2.titulation
FROM students t1
JOIN student_college_info t2 ON t1.id = t2.student_id
WHERE t2.career_id = 1; 
"""

neurosciences_view = """ 
CREATE OR REPLACE VIEW neuroscience_students AS
SELECT
    t1.id,
    t1.first_names,
    t1.paternal_surname,
    t1.maternal_surname, 
    t2.semester,
    t2.status,
    t2.regularity,
    t2.credits,
    t2.titulation
FROM students t1
JOIN student_college_info t2 ON t1.id = t2.student_id
WHERE t2.career_id = 2; 
"""

conn_to_postgres(technology_view)
conn_to_postgres(neurosciences_view)

Error: cannot drop columns from view
Error: cannot drop columns from view

Now that the coordinators have their respective views for their students I will give both coordinators the power to see all the professors.

```SQL
GRANT SELECT ON professors TO technology_coordinator, neurosciences_coordinator;
GRANT
```

It seems I am done with point 2 too! As the page seems like a complete work on its own, I think I can work with putting the step 3.5, that is related more to the database that on the web page. 

I think I could use the trigger to raise an exception where a student cannot inscribe more than two times to a single subject (less or equal than 2). 

This seems to also make use of a function (I suppose Mario is talking about a SQL function, as in python I already have one).

In [ ]:
check_attempts_limit_query = """
CREATE OR REPLACE FUNCTION check_attempts_limit()
RETURNS TRIGGER AS $$
DECLARE
    attempt_count INTEGER;
BEGIN
    SELECT COUNT(*) INTO subject_counter 
    FROM taken_subjects
    WHERE student_id = NEW.student_id
    AND subject_id = NEW.subject;

    IF attempt_count >= 2 THEN
        RAISE EXCEPTION "The student with id:% has already taken the 
        subject:% twice.", NEW.student_id, NEW.subject_id
    END IF;

    RETURN NEW;
END;
$$ LANGUAGE plpgsql; 
"""

My problem here is that I don't know what the correct logic is to store a tuple that combines a specific subject_id to a student_id. I think the problem lies in that on the taken_subjects table I just have students, how could I compare it with subjects if I don't have it there? 

It seems that creating another variable was also incorrect, as the way you reference the variable of triggers is with NEW. What NEW contains is basically the info that is used to trigger the function, in this case, the student and subject ids. 

Now I need to link this function to the taken_subjects table.

In [ ]:
trigger_two_courses_exception_query = """ 
CREATE TRIGGER trigger_check_attempts
BEFORE INSERT ON taken_subjects
FOR EACH ROW
EXECUTE FUNCTION check_attempts_limit();
"""

In case this function isn't enough (as I don't even know if it is possible to create a trigger without a function) I will create a function that sums all the credits of a student (and I might put that on the credits attribute of student_college_info)

In [ ]:
sum_credit_function_query = """ 
CREATE OR REPLACE FUNCTION calculate_total_credits(target_student_id INTEGER)
RETURN INTEGER AS $$
DECLARE
    total_credits INTEGER;
BEGIN
    SELECT SUM(credits) INTO total_credits
    FROM taken_subjects 
    WHERE id = student_id;

    IF total_credits = NULL THEN 
        RETURN 0
    END IF;

    RETURN total_credits;
END;
$$ LANGUAGE plpgsql; 
"""

Now we include the trigger into the credit attribute

In [ ]:
trigger_sum_credit_query = """ 
CREATE TRIGGER sum_credit
BEFORE SELECT ON student_college info
EXECUTE FUNCTION sum_credit() STORE current_credits
INSERT INTO credits current_credits; 
"""